---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ServiceAbbreviation
source: html/80d2b03f-23a5-1357-fe01-9843d79bb483.htm
---
# Autodesk.Revit.DB.FabricationPart.ServiceAbbreviation Property

The associated service abbreviation for the fabrication service.

## Syntax (C#)
```csharp
public string ServiceAbbreviation { get; }
```